In [2]:
import pandas as pd
import numpy as np

In [3]:
# Ejercicio 1. Crea un DataFrame a partir del siguiente diccionario:
datos = {
    'Producto': ['Laptop', 'Mouse', 'Teclado', 'Monitor', 'Tablet'],
    'Precio': [1200, 25, 80, 300, 450],
    'Stock': [15, 100, 50, 30, 25],
    'Categoria': ['Electrónica', 'Accesorio', 'Accesorio', 'Electrónica', 'Electrónica']
}
df1 = pd.DataFrame(datos)
df1

  Producto  Precio  Stock    Categoria
0   Laptop    1200     15  Electrónica
1    Mouse      25    100    Accesorio
2  Teclado      80     50    Accesorio
3  Monitor     300     30  Electrónica
4   Tablet     450     25  Electrónica

In [4]:
# Ejercicio 2. Crear otro dataframe a partir de la siguiente lista:
datos = [
    [1, 'Laptop', 1200, 15],
    [2, 'Mouse', 25, 100],
    [3, 'Teclado', 80, 50],
    [4, 'Monitor', 300, 30],
    [5, 'Tablet', 450, 25]
]

arr = np.array(datos)

df2 = pd.DataFrame(data=arr[:, 1:], index=arr[:, 0])
df2

         0     1    2
1   Laptop  1200   15
2    Mouse    25  100
3  Teclado    80   50
4  Monitor   300   30
5   Tablet   450   25

In [5]:
# Ejercicio 3. Muestra los primeros 3 registros de cada DataFrame.
print(df1.head(3))
print(df2.head(3))

  Producto  Precio  Stock    Categoria
0   Laptop    1200     15  Electrónica
1    Mouse      25    100    Accesorio
2  Teclado      80     50    Accesorio
         0     1    2
1   Laptop  1200   15
2    Mouse    25  100
3  Teclado    80   50

In [6]:
# Ejercicio 4. Del DataFrame creado en el ejercicio 1, muestra:

print("Shape:", df1.shape)
print("Columns:", df1.columns)
print("Datatypes:\n", df1.dtypes)
print("Statistics:\n", df1.describe())
print("2 last rows:\n", df1.tail(2))
print("2 random rows:\n", df1.sample(2))

Shape: (5, 4)
Columns: Index(['Producto', 'Precio', 'Stock', 'Categoria'], dtype='object')
Datatypes:
 Producto     object
Precio        int64
Stock         int64
Categoria    object
dtype: object
Statistics:
             Precio       Stock
count     5.000000    5.000000
mean    411.000000   44.000000
std     473.001057   33.800888
min      25.000000   15.000000
25%      80.000000   25.000000
50%     300.000000   30.000000
75%     450.000000   50.000000
max    1200.000000  100.000000
2 last rows:
   Producto  Precio  Stock    Categoria
3  Monitor     300     30  Electrónica
4   Tablet     450     25  Electrónica
2 random rows:
   Producto  Precio  Stock    Categoria
3  Monitor     300     30  Electrónica
1    Mouse      25    100    Accesorio

In [7]:
# Ejercicio 5. Realizar las siguientes seleciones del DataFrame del ejercicio 1.

print(df1.Producto)

print(df1[["Producto", "Precio"]])

print(df1.iloc[0])

print(df1.iat[1, 2])

print(df1.loc[0:1])

0     Laptop
1      Mouse
2    Teclado
3    Monitor
4     Tablet
Name: Producto, dtype: object
  Producto  Precio
0   Laptop    1200
1    Mouse      25
2  Teclado      80
3  Monitor     300
4   Tablet     450
Producto          Laptop
Precio              1200
Stock                 15
Categoria    Electrónica
Name: 0, dtype: object
100
  Producto  Precio  Stock    Categoria
0   Laptop    1200     15  Electrónica
1    Mouse      25    100    Accesorio

In [8]:
# Ejercicio 6. Ejecuta el código proporcionado para crear el DataFrame df_ventas
# con 100 registros
np.random.seed(42)
datos_ventas = {
    'Fecha': pd.date_range('2024-01-01', periods=100, freq='D'),
    'Producto': np.random.choice(['Laptop', 'Mouse', 'Teclado', 'Monitor',
    'Tablet'], 100),
    'Cantidad': np.random.randint(1, 10, 100),
    'Precio_Unitario': np.random.choice([1200, 25, 80, 300, 450], 100),
    'Region': np.random.choice(['Norte', 'Sur', 'Este', 'Oeste'], 100),
    'Vendedor': np.random.choice(['Ana', 'Carlos', 'Maria', 'Pedro'], 100)
}
df_ventas = pd.DataFrame(datos_ventas)
df_ventas['Venta_Total'] = df_ventas['Cantidad'] * df_ventas['Precio_Unitario']

df_ventas

        Fecha Producto  Cantidad  Precio_Unitario Region Vendedor  Venta_Total
0  2024-01-01  Monitor         7              300   Este      Ana         2100
1  2024-01-02   Tablet         9              300  Norte    Pedro         2700
2  2024-01-03  Teclado         8               80  Norte    Pedro          640
3  2024-01-04   Tablet         2              300  Oeste   Carlos          600
4  2024-01-05   Tablet         1               80   Este    Maria           80
..        ...      ...       ...              ...    ...      ...          ...
95 2024-04-05  Teclado         6              450  Oeste    Pedro         2700
96 2024-04-06   Tablet         1               80  Norte    Maria           80
97 2024-04-07    Mouse         9              300   Este   Carlos         2700
98 2024-04-08    Mouse         6             1200  Oeste   Carlos         7200
99 2024-04-09   Laptop         3              300    Sur    Maria          900

[100 rows x 7 columns]

In [9]:
# Todas las ventas de 'Laptop'
df_ventas[df_ventas["Producto"] == "Laptop"].head(5)

        Fecha Producto  Cantidad  Precio_Unitario Region Vendedor  Venta_Total
18 2024-01-19   Laptop         5               25  Oeste    Maria          125
23 2024-01-24   Laptop         7             1200   Este   Carlos         8400
24 2024-01-25   Laptop         1              300    Sur      Ana          300
33 2024-02-03   Laptop         6             1200  Norte      Ana         7200
38 2024-02-08   Laptop         4              300  Norte   Carlos         1200

In [10]:
# Ventas con monto total mayor a $1000
df_ventas[df_ventas["Venta_Total"] > 1000].head(5)

        Fecha Producto  Cantidad  Precio_Unitario Region Vendedor  Venta_Total
0  2024-01-01  Monitor         7              300   Este      Ana         2100
1  2024-01-02   Tablet         9              300  Norte    Pedro         2700
8  2024-01-09  Teclado         5              300  Oeste    Pedro         1500
10 2024-01-11  Monitor         8             1200  Norte      Ana         9600
11 2024-01-12  Teclado         6             1200    Sur   Carlos         7200

In [11]:
# Ventas realizadas por 'Maria' en la región 'Norte'

df_ventas[(df_ventas["Vendedor"] == "Maria") & (df_ventas.Region == "Norte")]

        Fecha Producto  Cantidad  Precio_Unitario Region Vendedor  Venta_Total
5  2024-01-06    Mouse         7               25  Norte    Maria          175
50 2024-02-20  Monitor         6               25  Norte    Maria          150
52 2024-02-22  Monitor         9               25  Norte    Maria          225
96 2024-04-06   Tablet         1               80  Norte    Maria           80

In [12]:
# Ejercicio 7. Manejo de valores nulos

# Crea una copia del DataFrame del ejercicio 6 e introduce valores nulos en 
# algunas celdas
df_ventas_nulls = df_ventas.copy()

np.random.seed(42)

for i in range(20):
    r = np.random.choice(df_ventas.shape[0])
    c = np.random.choice(df_ventas.shape[1])
    print(f"({r},{c})", df_ventas_nulls.iat[r, c])
    df_ventas_nulls.iat[r, c] = pd.NA

df_ventas_nulls

(51,4) Oeste
(14,2) 3
(71,4) Este
(20,6) 560
(82,6) 400.0
(74,2) 2.0
(87,4) Este
(99,2) 3.0
(21,4) Este
(1,3) 300
(29,5) Maria
(1,3) nan
(20,0) 2024-01-21 00:00:00
(75,1) Mouse
(21,4) <NA>
(88,0) 2024-03-29 00:00:00
(90,2) 8.0
(41,3) 80.0
(59,6) 10800.0
(61,5) Maria

        Fecha Producto  Cantidad  Precio_Unitario Region Vendedor  Venta_Total
0  2024-01-01  Monitor       7.0            300.0   Este      Ana       2100.0
1  2024-01-02   Tablet       9.0              NaN  Norte    Pedro       2700.0
2  2024-01-03  Teclado       8.0             80.0  Norte    Pedro        640.0
3  2024-01-04   Tablet       2.0            300.0  Oeste   Carlos        600.0
4  2024-01-05   Tablet       1.0             80.0   Este    Maria         80.0
..        ...      ...       ...              ...    ...      ...          ...
95 2024-04-05  Teclado       6.0            450.0  Oeste    Pedro       2700.0
96 2024-04-06   Tablet       1.0             80.0  Norte    Maria         80.0
97 2024-04-07    Mouse       9.0            300.0   Este   Carlos       2700.0
98 2024-04-08    Mouse       6.0           1200.0  Oeste   Carlos       7200.0
99 2024-04-09   Laptop       NaN            300.0    Sur    Maria        900.0

[100 rows x 7 columns]

In [13]:
# Identifica y cuenta los valores nulos por columna
df_ventas_nulls.isnull().sum()

Fecha              2
Producto           1
Cantidad           4
Precio_Unitario    2
Region             4
Vendedor           2
Venta_Total        3
dtype: int64

In [14]:
#Elimina las filas con valores nulos y compara el tamaño del DataFrame con
#el inicial

print(df_ventas_nulls.dropna().size)
print(df_ventas_nulls.size)

581
700

In [15]:
categorical_cols = ["Region", "Vendedor", "Producto"]

for c in categorical_cols:
    mode = df_ventas_nulls[c].mode()[0]
    df_ventas_nulls[c] = df_ventas_nulls[c].fillna(mode)

df_ventas_nulls = df_ventas_nulls.ffill()

mean_cantidad = round(df_ventas_nulls["Cantidad"].mean())
df_ventas_nulls["Cantidad"] = df_ventas_nulls["Cantidad"].fillna(mean_cantidad)

In [16]:
df_ventas_nulls["Precio_Unitario"] = df_ventas_nulls["Precio_Unitario"].fillna(
    df_ventas_nulls.groupby("Producto")["Precio_Unitario"].transform("mean")
)

df_ventas_nulls["Venta_Total"] = df_ventas_nulls["Cantidad"]*df_ventas_nulls["Precio_Unitario"]

df_ventas_nulls.isna().sum()

Fecha              0
Producto           0
Cantidad           0
Precio_Unitario    0
Region             0
Vendedor           0
Venta_Total        0
dtype: int64

In [17]:
# Ejercicio 8. Agrupaciones
# Calcula la venta total, promedio, máxima y número de ventas del total del
# DataFrame del ejercicio 6

print(df_ventas["Venta_Total"].mean())
print(df_ventas["Venta_Total"].max())

2301.6
10800

In [18]:
# Agrupa por 'Producto' y calcula la suma de ventas por producto

df_ventas.groupby("Producto")["Cantidad"].sum()

Producto
Laptop      99
Monitor    128
Mouse      106
Tablet      77
Teclado     80
Name: Cantidad, dtype: int64

In [19]:
#Agrupa por 'Region' y calcula la venta total, promedio, máxima y número de
#ventas

df_ventas.groupby("Region").agg(
    Total_Dinero=("Venta_Total", "sum"),
    Promedio_Venta=('Venta_Total', 'mean'),
    Venta_Mas_Grande=('Venta_Total', 'max'),
    Numero_Ventas=('Venta_Total', 'count')
)

        Total_Dinero  Promedio_Venta  Venta_Mas_Grande  Numero_Ventas
Region
Este           48915        2038.125              8400             24
Norte          45665        2283.250              9600             20
Oeste          56065        2242.600              8400             25
Sur            79515        2565.000             10800             31

In [20]:
# Identifica los top 3 vendedores por ventas totales

df_ventas.groupby("Vendedor").agg(
    Total_Ventas=("Venta_Total", "sum")
).sort_values(by="Total_Ventas", ascending=False).head(3)

df_ventas.groupby("Vendedor")["Venta_Total"].sum().sort_values().tail(3)

Vendedor
Pedro     55835
Ana       71900
Carlos    76570
Name: Venta_Total, dtype: int64

In [21]:
# Ejercicio 9

# Crea en el DataFrame del ejercicio 6 una nueva columna 'Venta_Con_IVA'
# aplicando 21% de IVA

df_ventas["Venta_Con_Iva"] = df_ventas["Venta_Total"] * 1.21
df_ventas

,Fecha,Producto,Cantidad,Precio_Unitario,Region,Vendedor,Venta_Total,Venta_Con_Iva
0,2024-01-01,Monitor,7,300,Este,Ana,2100,2541.0
1,2024-01-02,Tablet,9,300,Norte,Pedro,2700,3267.0
2,2024-01-03,Teclado,8,80,Norte,Pedro,640,774.4
3,2024-01-04,Tablet,2,300,Oeste,Carlos,600,726.0
4,2024-01-05,Tablet,1,80,Este,Maria,80,96.8
...,...,...,...,...,...,...,...,...
95,2024-04-05,Teclado,6,450,Oeste,Pedro,2700,3267.0
96,2024-04-06,Tablet,1,80,Norte,Maria,80,96.8
97,2024-04-07,Mouse,9,300,Este,Carlos,2700,3267.0
98,2024-04-08,Mouse,6,1200,Oeste,Carlos,7200,8712.0
99,2024-04-09,Laptop,3,300,Sur,Maria,900,1089.0

In [22]:
# Crea una columna 'Categoria_Precio' que clasifique como 'Alto' ( mayor que
# 500) o 'Bajo' (menor o igual que 500) según el precio


# df_ventas["Categoria_Precio"] = np.where(
#     df_ventas["Precio_Unitario"] > 500, 
#     "Alto",
#     "Bajo"
# ) Más eficiente

df_ventas["Categoria_Precio"] = df_ventas["Precio_Unitario"].apply(
    lambda x: "Alto" if x > 500 else "Bajo"
)
df_ventas

,Fecha,Producto,Cantidad,Precio_Unitario,Region,Vendedor,Venta_Total,Venta_Con_Iva,Categoria_Precio
0,2024-01-01,Monitor,7,300,Este,Ana,2100,2541.0,Bajo
1,2024-01-02,Tablet,9,300,Norte,Pedro,2700,3267.0,Bajo
2,2024-01-03,Teclado,8,80,Norte,Pedro,640,774.4,Bajo
3,2024-01-04,Tablet,2,300,Oeste,Carlos,600,726.0,Bajo
4,2024-01-05,Tablet,1,80,Este,Maria,80,96.8,Bajo
...,...,...,...,...,...,...,...,...,...
95,2024-04-05,Teclado,6,450,Oeste,Pedro,2700,3267.0,Bajo
96,2024-04-06,Tablet,1,80,Norte,Maria,80,96.8,Bajo
97,2024-04-07,Mouse,9,300,Este,Carlos,2700,3267.0,Bajo
98,2024-04-08,Mouse,6,1200,Oeste,Carlos,7200,8712.0,Alto
99,2024-04-09,Laptop,3,300,Sur,Maria,900,1089.0,Bajo

In [23]:
# Usa apply() para crear una columna 'Tipo_Venta' que clasifique las ventas
# como 'Pequeña' (menos de 500), 'Mediana' (menos de 2000) o 'Grande' (en
# otro caso)

df_ventas["Tipo_Venta"] = df_ventas["Venta_Total"].apply(
    lambda x: "Pequeña" if x < 500 else "Mediana" if x < 2000 else "Grande" 
)

df_ventas

,Fecha,Producto,Cantidad,Precio_Unitario,Region,Vendedor,Venta_Total,Venta_Con_Iva,Categoria_Precio,Tipo_Venta
0,2024-01-01,Monitor,7,300,Este,Ana,2100,2541.0,Bajo,Grande
1,2024-01-02,Tablet,9,300,Norte,Pedro,2700,3267.0,Bajo,Grande
2,2024-01-03,Teclado,8,80,Norte,Pedro,640,774.4,Bajo,Mediana
3,2024-01-04,Tablet,2,300,Oeste,Carlos,600,726.0,Bajo,Mediana
4,2024-01-05,Tablet,1,80,Este,Maria,80,96.8,Bajo,Pequeña
...,...,...,...,...,...,...,...,...,...,...
95,2024-04-05,Teclado,6,450,Oeste,Pedro,2700,3267.0,Bajo,Grande
96,2024-04-06,Tablet,1,80,Norte,Maria,80,96.8,Bajo,Pequeña
97,2024-04-07,Mouse,9,300,Este,Carlos,2700,3267.0,Bajo,Grande
98,2024-04-08,Mouse,6,1200,Oeste,Carlos,7200,8712.0,Alto,Grande
99,2024-04-09,Laptop,3,300,Sur,Maria,900,1089.0,Bajo,Mediana

In [31]:
# Ejercicio 10

info_producto = {
    'Producto': ['Laptop', 'Mouse', 'Teclado', 'Monitor', 'Tablet', 'Auriculares'],
    'Categoria': ['Electrónica', 'Accesorio', 'Accesorio', 'Electrónica',
    'Electrónica', 'Accesorio'],
    'Costo': [800, 15, 40, 200, 300, 20]
}
info_vendedores = {
    'Vendedor': ['Ana', 'Carlos', 'Maria', 'Pedro', 'Laura'],
    'Departamento': ['Ventas', 'Tecnología', 'Ventas', 'Marketing', 'Ventas'],
    'Salario_Base': [30000, 35000, 32000, 28000, 31000]
}

# Crea dos DataFrames adicionales: info_productos e info_vendedores

df_info_producto = pd.DataFrame(info_producto)
print(df_info_producto)

df_info_vendedores = pd.DataFrame(info_vendedores)
print(df_info_vendedores)

      Producto    Categoria  Costo
0       Laptop  Electrónica    800
1        Mouse    Accesorio     15
2      Teclado    Accesorio     40
3      Monitor  Electrónica    200
4       Tablet  Electrónica    300
5  Auriculares    Accesorio     20
  Vendedor Departamento  Salario_Base
0      Ana       Ventas         30000
1   Carlos   Tecnología         35000
2    Maria       Ventas         32000
3    Pedro    Marketing         28000
4    Laura       Ventas         31000

In [35]:
# Realiza un INNER JOIN entre df_ventas y info_producto

df_ventas.merge(
    right=df_info_producto,
    how="inner",
    on="Producto"
)

,Fecha,Producto,Cantidad,Precio_Unitario,Region,Vendedor,Venta_Total,Venta_Con_Iva,Categoria_Precio,Tipo_Venta,Categoria,Costo
0,2024-01-01,Monitor,7,300,Este,Ana,2100,2541.0,Bajo,Grande,Electrónica,200
1,2024-01-02,Tablet,9,300,Norte,Pedro,2700,3267.0,Bajo,Grande,Electrónica,300
2,2024-01-03,Teclado,8,80,Norte,Pedro,640,774.4,Bajo,Mediana,Accesorio,40
3,2024-01-04,Tablet,2,300,Oeste,Carlos,600,726.0,Bajo,Mediana,Electrónica,300
4,2024-01-05,Tablet,1,80,Este,Maria,80,96.8,Bajo,Pequeña,Electrónica,300
...,...,...,...,...,...,...,...,...,...,...,...,...
95,2024-04-05,Teclado,6,450,Oeste,Pedro,2700,3267.0,Bajo,Grande,Accesorio,40
96,2024-04-06,Tablet,1,80,Norte,Maria,80,96.8,Bajo,Pequeña,Electrónica,300
97,2024-04-07,Mouse,9,300,Este,Carlos,2700,3267.0,Bajo,Grande,Accesorio,15
98,2024-04-08,Mouse,6,1200,Oeste,Carlos,7200,8712.0,Alto,Grande,Accesorio,15
99,2024-04-09,Laptop,3,300,Sur,Maria,900,1089.0,Bajo,Mediana,Electrónica,800

In [ ]:
# Realiza un LEFT JOIN entre df_ventas y info_vendedores
df_nuevo = pd.merge(
    df_ventas, df_info_vendedores,
    how="left",
    on="Vendedor"
)

print(df_nuevo.query("Vendedor == 'Laura'")) # DataFrame vacío pq Laura no aparece en df_ventas

Empty DataFrame
Columns: [Fecha, Producto, Cantidad, Precio_Unitario, Region, Vendedor, Venta_Total, Venta_Con_Iva, Categoria_Precio, Tipo_Venta, Departamento, Salario_Base]
Index: []

In [ ]:
# Concatena al DataFrame del ejercicio 6 la siguiente información
datos = {
    'Fecha': ['2024-04-01'],
    'Producto': ['Auriculares'],
    'Cantidad': [2],
    'Precio_Unitario': [50],
    'Region': ['Norte'],
    'Vendedor': ['Laura'],
    'Venta_Total': [100]
}

pd.concat([df_ventas, pd.DataFrame(datos)], ignore_index=True) # ignore_index hace que la columna continue el número

,Fecha,Producto,Cantidad,Precio_Unitario,Region,Vendedor,Venta_Total,Venta_Con_Iva,Categoria_Precio,Tipo_Venta
0,2024-01-01 00:00:00,Monitor,7,300,Este,Ana,2100,2541.0,Bajo,Grande
1,2024-01-02 00:00:00,Tablet,9,300,Norte,Pedro,2700,3267.0,Bajo,Grande
2,2024-01-03 00:00:00,Teclado,8,80,Norte,Pedro,640,774.4,Bajo,Mediana
3,2024-01-04 00:00:00,Tablet,2,300,Oeste,Carlos,600,726.0,Bajo,Mediana
4,2024-01-05 00:00:00,Tablet,1,80,Este,Maria,80,96.8,Bajo,Pequeña
...,...,...,...,...,...,...,...,...,...,...
96,2024-04-06 00:00:00,Tablet,1,80,Norte,Maria,80,96.8,Bajo,Pequeña
97,2024-04-07 00:00:00,Mouse,9,300,Este,Carlos,2700,3267.0,Bajo,Grande
98,2024-04-08 00:00:00,Mouse,6,1200,Oeste,Carlos,7200,8712.0,Alto,Grande
99,2024-04-09 00:00:00,Laptop,3,300,Sur,Maria,900,1089.0,Bajo,Mediana
100,2024-04-01,Auriculares,2,50,Norte,Laura,100,NaN,NaN,NaN

In [85]:
# Ejercicio 11. Calcula las ventas entre el 2024-01-15 y el 2024-01-31

df_ventas[(df_ventas["Fecha"] >= "2024-01-15") & (df_ventas["Fecha"] <= "2024-01-31")]

filter = df_ventas["Fecha"].between("2024-01-15", "2024-01-31")
df_ventas[filter]

,Fecha,Producto,Cantidad,Precio_Unitario,Region,Vendedor,Venta_Total,Venta_Con_Iva,Categoria_Precio,Tipo_Venta
14,2024-01-15,Monitor,3,80,Sur,Carlos,240,290.40,Bajo,Pequeña
15,2024-01-16,Mouse,5,300,Este,Maria,1500,1815.00,Bajo,Mediana
16,2024-01-17,Monitor,3,1200,Oeste,Ana,3600,4356.00,Alto,Grande
17,2024-01-18,Tablet,1,1200,Sur,Pedro,1200,1452.00,Alto,Mediana
18,2024-01-19,Laptop,5,25,Oeste,Maria,125,151.25,Bajo,Pequeña
19,2024-01-20,Monitor,7,25,Sur,Maria,175,211.75,Bajo,Pequeña
20,2024-01-21,Mouse,7,80,Oeste,Pedro,560,677.60,Bajo,Mediana
21,2024-01-22,Tablet,9,300,Este,Carlos,2700,3267.00,Bajo,Grande
22,2024-01-23,Monitor,3,25,Sur,Maria,75,90.75,Bajo,Pequeña
23,2024-01-24,Laptop,7,1200,Este,Carlos,8400,10164.00,Alto,Grande
24,2024-01-25,Laptop,1,300,Sur,Ana,300,363.00,Bajo,Pequeña
25,2024-01-26,Teclado,4,300,Este,Carlos,1200,1452.00,Bajo,Mediana
26,2024-01-27,Teclado,4,1200,Este,Ana,4800,5808.00,Alto,Grande
27,2024-01-28,Mouse,5,25,Sur,Carlos,125,151.25,Bajo,Pequeña
28,2024-01-29,Monitor,7,1200,Sur,Maria,8400,10164.00,Alto,Grande
29,2024-01-30,Monitor,7,300,Sur,Maria,2100,2541.00,Bajo,Grande
30,2024-01-31,Teclado,4,450,Norte,Ana,1800,2178.00,Bajo,Mediana